results2Cores/abNginxJustProxyImage.txt
stephen@comet:~$ ab -n100000 -c100 -g plotdata.tsv http://meteor/image.jpg
This is ApacheBench, Version 2.3 <$Revision: 1528965 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking meteor (be patient)
Completed 10000 requests
Completed 20000 requests
Completed 30000 requests
Completed 40000 requests
Completed 50000 requests
Completed 60000 requests
Completed 70000 requests
Completed 80000 requests
Completed 90000 requests
Completed 100000 requests
Finished 100000 requests


Server Software:        nginx/1.4.6
Server Hostname:        meteor
Server Port:            80

Document Path:          /image.jpg
Document Length:        100018 bytes

Concurrency Level:      100
Time taken for tests:   107.281 seconds
Complete requests:      100000
Failed requests:        0
Total transferred:      10033200000 bytes
HTML transferred:       10001800000 bytes
Requests per second:    932.14 [#/sec] (mean)
Time per request:       107.281 [ms] (mean)
Time per request:       1.073 [ms] (mean, across all concurrent requests)
Transfer rate:          91331.10 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    1  11.5      0    1004
Processing:     2  106  36.8    112     472
Waiting:        1   79  29.6     80     279
Total:          2  107  38.3    113    1179

Percentage of the requests served within a certain time (ms)
  50%    113
  66%    123
  75%    130
  80%    134
  90%    145
  95%    153
  98%    174
  99%    193
 100%   1179 (longest request)