results2Cores/abNginxJustProxyRoot.txt
stephen@comet:~$ ab -n100000 -c100 -g plotdata.tsv http://meteor/
This is ApacheBench, Version 2.3 <$Revision: 1528965 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking meteor (be patient)
Completed 10000 requests
Completed 20000 requests
Completed 30000 requests
Completed 40000 requests
Completed 50000 requests
Completed 60000 requests
Completed 70000 requests
Completed 80000 requests
Completed 90000 requests
Completed 100000 requests
Finished 100000 requests


Server Software:        nginx/1.4.6
Server Hostname:        meteor
Server Port:            80

Document Path:          /
Document Length:        687 bytes

Concurrency Level:      100
Time taken for tests:   82.325 seconds
Complete requests:      100000
Failed requests:        0
Total transferred:      87800000 bytes
HTML transferred:       68700000 bytes
Requests per second:    1214.70 [#/sec] (mean)
Time per request:       82.325 [ms] (mean)
Time per request:       0.823 [ms] (mean, across all concurrent requests)
Transfer rate:          1041.51 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    1   1.7      0      22
Processing:     9   82  19.4     86     149
Waiting:        8   81  19.7     86     149
Total:         10   82  18.6     86     149

Percentage of the requests served within a certain time (ms)
  50%     86
  66%     91
  75%     94
  80%     96
  90%    102
  95%    107
  98%    114
  99%    118
 100%    149 (longest request)